import React from 'react'
import { PrimaryCTA } from '../components/PrimaryCTA'

export const Main = () => (
  <div
    style={{
      backgroundColor: '#ffffff',
      borderRadius: '40px',
      boxShadow: '0 0 30px #121417',
      paddingTop: '2rem'
    }}
  >
    <main style={{ maxWidth: '960px', margin: 'auto' }}>
      <section>
        <p>
          Развитие телекоммуникационных технологий приводит к тому, что
          благодаря сетевым связям самопроизвольно формируются новые социальные
          объединения – сетевые сообщества.
        </p>
        <p>
          Профессиональное сетевое сообщество – это формальная или неформальная
          группа профессионалов, работающих в одной предметной или проблемной
          профессиональной деятельности в сети.
        </p>
        <p>
          Цели сетевого сообщества: создание единого информационного
          пространства, доступного для каждого члена сообщества; организация
          формального и неформального общения на профессиональные темы;
          инициация виртуального взаимодействия для последующего взаимодействия
          вне Интернета; обмен опытом.
        </p>
        <p>
          Данное сообщество создано в целях неформального общения на
          профессиональные темы, создания комфортной среды для общения
          профессионалов своего дела и молодых специалистов, основанное на
          взаимном уважении, поддержке и взаимопомощи. Объединение знаний
          участников данного сообщества призвано помочь в решении
          профессиональных задач.
        </p>
      </section>
      <section>
        <h1>Общие правила</h1>
        <ol>
          <li>
            Данные правила распространяются на всех участников сообщества без
            исключений (администратор, модератор, участник)
          </li>
          <li>
            Вступая в указанное сообщество, вы соглашаетесь с соблюдением всех
            правил сервера. Незнание правил не освобождает Вас от
            ответственности
          </li>
          <li>
            Для общения в сообществе используется русский язык и
            профессиональная терминология и аббревиатуры, искажение
            профессиональных терминов с целью придания им иного значения не
            допускается.
          </li>
          <li>
            Nickname не может содержать адрес сайта и ненормативную лексику,
            повторять никнеймы других участников сообщества до степени смешения.
            Запрещается использование в Nickname, аватарах, подписях символику,
            лозунги, которые могут быть неоднозначно восприняты или трактованы.
          </li>
        </ol>
      </section>
      <section>
        <h1>Запреты и ограничения</h1>
        <ol>
          <li>
            Не допускается обсуждение темы ранее рассмотренной в рамках
            сообщества в течение последних 7 дней.
          </li>
          <li>
            Не допускается «Капс» и более чем троекратное повторение символа с
            целью привлечения внимания к обсуждаемой теме (!!!, SOS – и прочие)
          </li>
          <li>
            Не допускается размещение сообщения, явно не соответствующего
            тематике сообщества;
          </li>
          <li>
            Не допускается размещение сообщений содержащих любые виды
            политической, гендерной, расовой пропоганды.
          </li>
          <li>
            Запрещено размещение сообщения более одного раза, даже с учетом
            относительно старых сообщений близкого содержания, при нарушении
            данного правила более 5 раз – рискуете потерять возможность
            создавать сообщения;
          </li>
          <li>
            Запрещается дублировать сообщения в соседние сообщества, также в
            случае злоупотребления или офф-топика удаляются все сообщения;
          </li>
          <li>
            Запрещается размещать коммерческие сообщения без согласования с
            администрацией сообщества. Под коммерческими понимаются сообщения,
            содержащие рекламу товаров или платных услуг, а также прямо или
            косвенно направленные на получение прибыли заинтересованными лицами;
          </li>
          <li>
            Запрещается размещать приглашения на другие сайты. Такие посты
            удаляются, а пользователь исключается из сообщества;
          </li>
          <li>
            Запрещено размещать любую информацию, противоречащую
            законодательству;
          </li>
          <li>
            Запрещено оскорблять других участников сообщества и переходить на
            личности; ругаться матом (за оскорбления модераторов или других
            членов сообщества вы будете исключены);
          </li>
          <li>
            Запрещается оставлять оскорбительные, порочащие или нелицеприятные
            высказывания в адрес третьих сторон (людей, организаций);
          </li>
          <li>
            Запрещается предоставлять в качестве ответов непроверенные или
            заведомо неверные сведения.
          </li>
        </ol>
      </section>
      <section>
        <h1>Ожидаемый порядок общения</h1>
        <ol>
          <li>Активное участие в обсуждении тем в сообществе;</li>
          <li>Контакт с администрацией по вопросам продвижения сообщества</li>
          <li>
            Предложения по улучшению социальной составляющей внутри сообщества,
            в том числе путем внесения дополнительных тематик в виде обсуждения
            профессиональных новостей;
          </li>
          <li>
            Выражение собственной позиции по какому либо вопросу, либо согласие
            с автором.
          </li>
          <li>
            Активное общение, привлечение знакомых и друзей к участию в
            сообществе.
          </li>
        </ol>
      </section>
      <section>
        <h1> Полномочия модераторов</h1>
        <ol>
          <li>
            Модератор может удалять любые сообщения нарушителей и все ответы на
            них.
          </li>
          <li>
            Модератор может удалить любое сообщение, если оно своим содержанием
            провоцирует посетителей
          </li>
          <li>
            Запрещено публичное обсуждение действий модераторов и
            неконструктивная критика сообщества.
          </li>
          <li>
            Запрещены попытки продолжить дискуссию, пресеченную модератором.
          </li>
        </ol>
      </section>
      <section>
        <h1>Наказание за нарушение правил сообщества</h1>
        <ol>
          <li>
            В случае однократного нарушения указанных правил выносится
            предупреждение.
          </li>
          <li>
            Последующие нарушения, либо грубые однократные нарушения признанные
            противоречащим целям сообщества приводят к исключению из сообщества.
          </li>
        </ol>
      </section>
      <section>
        <h1>Заключительные положения</h1>
        <ol>
          <li>
            Весь контент на ресурсе является собственностью администрации
            сообщества. Администрация имеет право в одностороннем порядке
            удалять, изменять, перемещать и совершать иные действия с данным
            контентом и т.д., а так же изменять правила данного соглашения.
          </li>
        </ol>
      </section>
      <section>
        <h1>Стать модератором</h1>
        <p>Модератором может стать любой желающий бесплатно.</p>
        <p>Требования к модераторам:</p>
        <ul>
          <li>Высокий онлайн: регулярное посещение сообщества.</li>
          <li>Соблюдение правил на этой странице.</li>
          <li>Защита сообщества от спамеров, ботов и флейма.</li>
          <li>Знание и понимание react.js.</li>
        </ul>
        <p>
          Пишите <a href='https://t.me/ychebotaev'>@ychebotaev</a>, чтобы
          присоединиться к модераторскому составу.
        </p>
      </section>
      <section>
        <h1>Реабилитация в сообществе</h1>
        <p>Несправедливо забанилили?</p>
        <p>Вы поняли свою ошибку и больше так не будете?</p>
        <p>
          Пишите <a href='https://t.me/ychebotaev'>@ychebotaev</a>, разберемся.
        </p>
      </section>
      <section>
        <h1>Организация на GitHub</h1>
        <p>
          На GitHub зарегистрирована организация&nbsp;
          <a href='https://github.com/react-ru'>react-ru</a>, где хранится&nbsp;
          <a href='https://github.com/react-ru/react_ru'>этот сайт</a>.
        </p>
        <p>
          Чтобы присоединисться, пишите&nbsp;
          <a href='https://t.me/ychebotaev'>@ychebotaev</a>.
        </p>
      </section>
      <section>
        <h1>Организация в npm</h1>
        <p>
          У группы также есть&nbsp;
          <a href='https://www.npmjs.com/org/react_ru'>
            одноименная организация в npm-е
          </a>
          .
        </p>
        <p>
          Чтобы присоединисться, пишите&nbsp;
          <a href='https://t.me/ychebotaev'>@ychebotaev</a>.
        </p>
      </section>
      <div
        style={{
          display: 'flex',
          alignItems: 'center',
          justifyContent: 'center',
          paddingTop: '3rem',
          paddingBottom: '3rem',
          backgroundColor: '#f5f4f4',
          borderTop: '1px solid #e8e8e8',
          width: 'calc(100vw)',
          marginLeft: 'calc(-1 * (100vw - 960px) / 2)',
          marginTop: '3rem',
          borderBottomLeftRadius: '40px',
          borderBottomRightRadius: '40px'
        }}
      >
        <PrimaryCTA />
      </div>
    </main>
  </div>
)
